Repository: achmstein/Chillax
Catalog: src/client_app/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Chillax
ar: تشيلاكس

# cafeAndGaming
source: Cafe & Gaming
ar: كافيه وجيمنج

source: Done
ar: تم

source: Sign In
ar: دخول

source: Sign Up
ar: تسجيل

source: Register
ar: تسجيل

source: Sign Out
ar: خروج

source: Username
ar: اليوزر

source: Username or Email
ar: اليوزر أو الايميل

source: Email
ar: الايميل

source: Password
ar: الباسورد

source: Confirm Password
ar: تأكيد الباسورد

source: Name
ar: الاسم

# enterUsername
source: Enter your username
ar: ادخل اليوزر

# enterUsernameOrEmail
source: Enter your username or email
ar: ادخل اليوزر أو الايميل

# enterEmail
source: Enter your email
ar: ادخل الايميل

# enterPassword
source: Enter your password
ar: ادخل الباسورد

# createPassword
source: Create a password
ar: اعمل باسورد

source: Confirm your password
ar: أكد الباسورد

# chooseUsername
source: Choose a username
ar: اختار يوزر

source: Your display name
ar: اسمك

source: or continue with
ar: أو سجل بـ

source: Google
ar: جوجل

source: Apple
ar: أبل

# dontHaveAccount
source: Don't have an account?
ar: معندكش حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: عندك حساب؟

source: Create Account
ar: عمل حساب

source: Guest User
ar: زائر

# enterBothEmailAndPassword
source: Please enter both email and password.
ar: ادخل الايميل والباسورد.

# invalidCredentials
source: Invalid email or password. Please try again.
ar: الايميل أو الباسورد غلط. جرب تاني.

# anErrorOccurred
source: An error occurred: {error}
ar: حصل مشكلة: {error}

# socialSignInFailed
source: Social sign in failed. Please try again.
ar: الدخول فشل. جرب تاني.

# fillAllFields
source: Please fill in all fields.
ar: املا كل الخانات.

# passwordsDontMatch
source: Passwords do not match.
ar: الباسورد مش متطابق.

# passwordTooShort
source: Password must be at least 6 characters.
ar: الباسورد لازم يكون 6 حروف على الأقل.

# registrationSuccessful
source: Registration successful! Please sign in.
ar: تم التسجيل! سجل دخولك.

# registrationFailed
source: Registration failed. Email may already exist.
ar: التسجيل فشل. الايميل ممكن يكون موجود قبل كده.

source: Success
ar: تمام

source: Error
ar: خطأ

source: Cancel
ar: الغاء

source: Delete
ar: مسح

source: Clear
ar: مسح

source: Retry
ar: جرب تاني

source: Join
ar: ادخل

source: Close
ar: قفل

source: Menu
ar: المنيو

source: Orders
ar: الطلبات

source: Rooms
ar: الاوض

source: Profile
ar: حسابي

source: Cart
ar: السلة

source: Settings
ar: الاعدادات

source: Search menu...
ar: دور في المنيو...

source: No items available
ar: مفيش حاجات متاحة

# failedToLoadMenu
source: Failed to load menu: {error}
ar: المنيو مش بيحمل: {error}

source: View Cart
ar: شوف السلة

source: Add to Cart
ar: أضف للسلة

source: Your cart is empty
ar: السلة فاضية

# addItemsFromMenu
source: Add items from the menu
ar: ضيف حاجات من المنيو

source: Order Note (optional)
ar: ملاحظة (اختياري)

source: Any special requests
ar: أي طلبات خاصة

source: Use Loyalty Points
ar: استخدم النقط

source: pts
ar: نقطة

source: Subtotal
ar: المجموع

source: Points discount
ar: خصم النقط

source: Total
ar: الإجمالي

source: Place Order
ar: أكد الطلب

source: Clear Cart
ar: فضي السلة

# removeAllItemsFromCart
source: Remove all items from your cart?
ar: تمسح كل الحاجات من السلة؟

source: Order placed successfully!
ar: الطلب اتأكد!

source: Failed to place order
ar: الطلب مش بيتأكد

# noteWithText
source: Note: {notes}
ar: ملاحظة: {notes}

source: Failed to load orders
ar: الطلبات مش بتحمل

source: Pull down to retry
ar: اسحب لتحت تجرب تاني

source: No orders yet
ar: مفيش طلبات لسه

# orderHistoryWillAppearHere
source: Your order history will appear here
ar: طلباتك هتظهر هنا

# orderNumber
source: Order #{id}
ar: طلب #{id}

source: No items
ar: مفيش حاجات

source: Your rating:
ar: تقييمك:

source: Rate This Order
ar: قيّم الطلب ده

source: Failed to load details
ar: التفاصيل مش بتحمل

# enterSixDigitCode
source: Enter 6-digit code
ar: ادخل كود من 6 أرقام

# enterFourDigitCode
source: Enter 4-digit code
ar: ادخل كود من 4 أرقام

source: Enter code
ar: ادخل الكود

source: Invalid code
ar: الكود غلط

source: Joined session!
ar: دخلت الجلسة!

source: Failed to load rooms
ar: الاوض مش بتحمل

source: Session Active
ar: الجلسة شغالة

source: Share code with friends
ar: شير الكود مع صحابك

source: Code copied!
ar: الكود اتنسخ!

source: Need something?
ar: عايز حاجة؟

# callWaiter
source: Waiter
ar: الويتر

source: Controller
ar: دراع

source: Get Bill
ar: الفاتورة

# waiterNotified
source: Waiter has been notified
ar: الويتر عرف

source: Controller request sent
ar: طلب الدراع اتبعت

source: Bill request sent
ar: طلب الفاتورة اتبعت

source: Reserved
ar: محجوزة

source: Cancel Reservation
ar: الغي الحجز

# cancelReservationQuestion
source: Cancel Reservation?
ar: تلغي الحجز؟

# confirmCancelReservation
source: Are you sure you want to cancel your reservation?
ar: متأكد انك عايز تلغي الحجز؟

source: No, Keep
ar: لا، خليه

source: Yes, Cancel
ar: أيوه، الغي

source: Reservation cancelled
ar: الحجز اتلغى

source: Failed to cancel reservation
ar: الحجز مش بيتلغي

# allRoomsBusy
source: All rooms are currently busy
ar: كل الاوض مشغولة دلوقتي

# getNotifiedWhenAvailable
source: Get notified when a room becomes available
ar: هنبلغك لما اوضة تفضى

# willBeNotifiedWhenAvailable
source: You will be notified when a room is available
ar: هنبلغك لما اوضة تفضى

source: Unsubscribed from notifications
ar: الاشعارات اتلغت

source: You will be notified!
ar: هنبلغك!

source: Failed to subscribe
ar: الاشتراك فشل

source: Notify Me
ar: بلغني

# fifteenMinutesToArrive
source: 15 minutes to arrive
ar: عندك 10 دقايق توصل

# reservationCancelledIfNoCheckIn
source: Your reservation will be automatically cancelled if you don't check in within 15 minutes.
ar: الحجز هيتلغي لو موصلتش خلال 10 دقايق.

source: Reserve {roomName}
ar: احجز {roomName}

# perHour
source: /hr
ar: /ساعة

source: Reserve Now
ar: احجز دلوقتي

# roomReservedSuccess
source: Room reserved! You have 15 minutes to arrive.
ar: الحجز تم! عندك 10 دقايق توصل.

source: Failed to reserve room
ar: الحجز فشل

source: Available
ar: متاحة

source: Occupied
ar: مشغولة

source: Maintenance
ar: صيانة

# statusReserved
source: Reserved
ar: محجوزة

# statusActive
source: Active
ar: شغال

# statusCompleted
source: Completed
ar: انتهى

# statusCancelled
source: Cancelled
ar: ملغي

# hourlyRateFormat
source: £{rate}/hour
ar: {rate} ج.م/ساعة

source: Order History
ar: طلباتي السابقة

source: Session History
ar: حجوزاتي السابقة

source: Favorites
ar: المفضلة

# helpAndSupport
source: Help & Support
ar: المساعدة

source: About
ar: عن التطبيق

# version
source: Version {version}
ar: الاصدار {version}

# signOutConfirmation
source: Are you sure you want to sign out?
ar: متأكد انك عايز تخرج؟

source: Need help? Contact us:
ar: محتاج مساعدة؟ كلمنا:

# supportHours
source: 5:00 PM - 5:00 AM
ar: 5 بليل - 5 الصبح

# aboutDescription
source: Order delicious food & drinks, or reserve a PlayStation room for an amazing gaming experience.
ar: اطلب مشروبات وأكل حلو، أو احجز اوضة بلايستيشن وانبسط.

source: Notifications
ar: الاشعارات

source: Order Status Updates
ar: تحديثات الطلب

# orderStatusUpdatesDescription
source: Get notified when your order status changes
ar: هنبلغك لما الطلب يتغير

# promotionsAndOffers
source: Promotions & Offers
ar: العروض

# promotionsDescription
source: Receive special deals and discounts
ar: هنبلغك بالعروض والخصومات

source: Session Reminders
ar: تذكير الجلسات

# sessionRemindersDescription
source: Get reminded before your gaming session
ar: هنفكرك قبل الجلسة

source: Appearance
ar: الشكل

source: Theme
ar: الثيم

source: Account
ar: الحساب

source: Change Password
ar: غير الباسورد

source: Update Email
ar: غير الايميل

source: Delete Account
ar: امسح الحساب

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone.
ar: متأكد انك عايز تمسح حسابك؟ مش هتقدر ترجعه.

source: Account deleted successfully
ar: الحساب اتمسح

source: Failed to delete account
ar: الحساب مش بيتمسح

source: Select Theme
ar: اختار الثيم

source: Light
ar: فاتح

# lightThemeDescription
source: Always use light theme
ar: الثيم الفاتح دايماً

source: Dark
ar: غامق

# darkThemeDescription
source: Always use dark theme
ar: الثيم الغامق دايماً

source: System Default
ar: تلقائي

# systemDefaultDescription
source: Follow your device settings
ar: زي الموبايل

source: Language
ar: اللغة

source: Select Language
ar: اختار اللغة

source: Arabic
ar: عربي

# currency
source: EGP
ar: ج.م

# priceFormat
source: £{price}
ar: {price} ج.م

# priceAdjustmentPlus
source: (+£{price})
ar: (+{price} ج.م)

# priceAdjustmentMinus
source: (-£{price})
ar: (-{price} ج.م)

# discountFormat
source: -£{price}
ar: -{price} ج.م

# basePrice
source: Base price: £{price}
ar: السعر: {price} ج.م

source: Special Instructions
ar: ملاحظات

# anySpecialRequestsOptional
source: Any special requests?
ar: أي طلبات خاصة؟

source: Required
ar: مطلوب

source: Loyalty Rewards
ar: مكافآت الولاء

source: Recent Activity
ar: النشاط الأخير

source: No loyalty account yet
ar: معندكش حساب ولاء لسه

# makePurchaseToEarn
source: Make a purchase to start earning points!
ar: اشتري حاجة وابدأ تجمع نقط!

source: No transactions yet
ar: مفيش معاملات لسه

source: Charge
ar: رسوم

source: Payment
ar: دفع

# byPerson
source: by {name}
ar: بواسطة {name}

source: Today
ar: النهاردة

source: Yesterday
ar: إمبارح

# daysAgo
source: {days}d ago
ar: من {days} يوم

source: Amount Due
ar: مبلغ مستحق

source: Credit Balance
ar: رصيد دائن

# pleasePayAtCounter
source: Please pay at the counter
ar: ادفع في الكاشير

# willBeAppliedToNextPurchase
source: Will be applied to your next purchase
ar: هيتخصم من طلبك الجاي

source: No outstanding balance
ar: مفيش رصيد

source: Transactions
ar: المعاملات

source: Failed to load transactions
ar: المعاملات مش بتحمل

# failedToLoadFavorites
source: Failed to load favorites: {error}
ar: المفضلة مش بتحمل: {error}

source: Browse Menu
ar: تصفح المنيو

source: Join our Loyalty Program
ar: اشترك في برنامج الولاء

# earnPointsDescription
source: Earn points on every purchase and unlock exclusive rewards!
ar: اجمع نقط من كل طلب واستمتع بمكافآت حصرية!

source: Join Now
ar: اشترك دلوقتي

source: View history
ar: شوف السجل

# lifetimePoints
source: Lifetime: {points} pts
ar: إجمالي: {points} نقطة

# pointsToNextTier
source: {points} pts to {tier}
ar: {points} نقطة لـ {tier}

source: Rate Your Order
ar: قيّم طلبك

source: Your Review (optional)
ar: رأيك (اختياري)

source: Share your experience...
ar: شاركنا تجربتك...

source: Submit Rating
ar: أرسل التقييم

# ratingPoor
source: Poor
ar: سيء

# ratingFair
source: Fair
ar: مقبول

# ratingGood
source: Good
ar: جيد

# ratingVeryGood
source: Very Good
ar: جيد جداً

# ratingExcellent
source: Excellent
ar: ممتاز

source: New Password
ar: الباسورد الجديد

# enterNewPassword
source: Please enter a new password
ar: ادخل الباسورد الجديد

# passwordMustBe8Chars
source: Password must be at least 8 characters
ar: الباسورد لازم يكون 8 حروف على الأقل

# pleaseConfirmPassword
source: Please confirm your password
ar: أكد الباسورد

source: Password changed successfully
ar: الباسورد اتغير

# failedToChangePassword
source: Failed to change password. Please try again.
ar: الباسورد مش بيتغير. جرب تاني.

source: New Email
ar: الايميل الجديد

# pleaseEnterEmail
source: Please enter an email address
ar: ادخل الايميل

# pleaseEnterValidEmail
source: Please enter a valid email address
ar: ادخل ايميل صحيح

source: Email updated successfully
ar: الايميل اتغير

# failedToUpdateEmail
source: Failed to update email. Please try again.
ar: الايميل مش بيتغير. جرب تاني.

source: Joined session successfully!
ar: دخلت الجلسة!

source: No favorites yet
ar: مفيش مفضلة لسه

# noFavoritesDescription
source: Items you love will appear here
ar: الحاجات اللي بتحبها هتظهر هنا

# createStrongPassword
source: Create a strong password
ar: اعمل باسورد قوي

# passwordRequirements
source: Your password must be at least 8 characters long. We recommend using a mix of letters, numbers, and symbols.
ar: الباسورد لازم يكون 8 حروف على الأقل. نفضل خلط حروف وأرقام ورموز.

source: Current Email
ar: الايميل الحالي

# enterNewEmailAddress
source: Enter your new email address
ar: ادخل الايميل الجديد

# emailUpdateInstructions
source: We'll update your account with the new email address. Make sure you have access to this email.
ar: هنحدث حسابك بالايميل الجديد. تأكد إنك تقدر تدخل عليه.

source: Failed to load sessions
ar: الجلسات مش بتحمل

source: No sessions yet
ar: مفيش حجوزات لسه

# reserveRoomToStart
source: Reserve a room to get started
ar: احجز اوضة عشان تبدأ

# durationLabel
source: Duration: {duration}
ar: المدة: {duration}

source: Phone Number
ar: رقم الموبايل

# enterPhoneNumber
source: Enter your phone number
ar: ادخل رقم الموبايل

source: Your phone number
ar: رقمك

# tierBronze
source: BRONZE
ar: برونزي

# tierSilver
source: SILVER
ar: فضي

# tierGold
source: GOLD
ar: ذهبي

# tierPlatinum
source: PLATINUM
ar: بلاتيني

# transactionTypePurchase
source: Purchase
ar: شراء

# transactionTypeBonus
source: Bonus
ar: مكافأة

# transactionTypeReferral
source: Referral
ar: إحالة

# transactionTypePromotion
source: Promotion
ar: عرض

# transactionTypeRedemption
source: Redemption
ar: استبدال

# transactionTypeAdjustment
source: Adjustment
ar: تعديل

# pointsEarnedFromOrder
source: Points earned from order #{orderId}
ar: نقط مكتسبة من طلب #{orderId}

# pointsRedeemedForOrder
source: Points redeemed for order #{orderId}
ar: نقط مستخدمة في طلب #{orderId}

source: Customizable
ar: قابل للتخصيص

source: Join Session
ar: ادخل الجلسة

source: Enter Access Code
ar: ادخل كود الدخول

# accessCodeDescription
source: Ask the session owner or staff for the 6-digit code
ar: اطلب الكود من صاحب الجلسة أو الموظف

source: Session Found
ar: الجلسة موجودة

source: Session not found
ar: الجلسة مش موجودة

source: Failed to fetch session
ar: الجلسة مش بتحمل

source: Failed to join session
ar: الدخول للجلسة فشل

# memberCountFormat
source: {count} members
ar: {count} أعضاء

# pleaseWaitBeforeRequest
source: Please wait before making another request
ar: استنى شوية قبل ما تطلب تاني

source: Failed to send request
ar: الطلب مش بيتبعت

source: Update Name
ar: تحديث الاسم

# enterNewName
source: Enter your new display name
ar: ادخل اسمك الجديد

source: Name updated successfully
ar: تم تحديث الاسم بنجاح

source: New name
ar: الاسم الجديد

# failedToUpdateName
source: Failed to update name. Please try again.
ar: الاسم مش بيتغير. جرب تاني.

source: Call Us
ar: كلمنا

source: Most Popular
ar: الأكثر طلباً
