Repository: achmstein/Chillax
Catalog: src/admin_app/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Chillax Admin
ar: تشيلاكس ادمن

source: Dashboard
ar: لوحة التحكم

source: Pending
ar: معلّق

source: Active
ar: نشط

source: Available
ar: متاح

source: Pending Orders
ar: الطلبات المعلقة

source: Active Sessions
ar: الجلسات النشطة

source: Available Rooms
ar: الغرف المتاحة

source: View all
ar: عرض الكل

source: No pending orders
ar: مفيش طلبات معلقة

source: No active sessions
ar: مفيش جلسات نشطة

source: Sign In
ar: تسجيل الدخول

source: Sign Out
ar: تسجيل الخروج

source: Admin Dashboard
ar: لوحة تحكم الأدمن

source: Username or Email
ar: اليوزر أو الإيميل

# enterUsernameOrEmail
source: Enter your username or email
ar: اكتب اليوزر أو الإيميل

source: Password
ar: الباسورد

# enterPassword
source: Enter your password
ar: اكتب الباسورد

source: Error
ar: خطأ

# adminRoleRequired
source: You must have Admin role to access this application.
ar: لازم يكون عندك صلاحية أدمن عشان تدخل التطبيق ده.

# enterBothFields
source: Please enter both username and password.
ar: من فضلك اكتب اليوزر والباسورد.

# invalidCredentials
source: Invalid username or password. Please try again.
ar: اليوزر أو الباسورد غلط. حاول تاني.

source: Orders
ar: الطلبات

source: Cancel Order
ar: إلغاء الطلب

# cancelOrderQuestion
source: Cancel Order?
ar: إلغاء الطلب؟

# cancelOrderConfirmation
source: Are you sure you want to cancel this order?
ar: متأكد إنك عايز تلغي الطلب ده؟

source: Keep
ar: خليه

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Add
ar: إضافة

source: Save
ar: حفظ

source: Update
ar: تحديث

source: Create
ar: إنشاء

source: Close
ar: إغلاق

source: OK
ar: تمام

source: Failed to load
ar: فشل التحميل

source: item
ar: عنصر

source: Items
ar: العناصر

# itemCount
source: {count} {count, plural, =1{item} other{items}}
ar: {count} {count, plural, =1{عنصر} other{عناصر}}

source: Note
ar: ملاحظة

source: Customer Note
ar: ملاحظة العميل

source: Total
ar: الإجمالي

source: Date
ar: التاريخ

source: each
ar: الواحدة

# orderNumber
source: Order #{id}
ar: طلب #{id}

source: Validating
ar: جاري التحقق

source: Confirmed
ar: مؤكد

source: Cancelled
ar: ملغي

source: Confirm Order
ar: تأكيد الطلب

# cancelOrderButton
source: Cancel Order
ar: إلغاء الطلب

source: No, Keep
ar: لا، خليه

source: Yes, Cancel
ar: أيوه، الغيه

source: Rooms
ar: الغرف

source: Add Room
ar: إضافة غرفة

source: Edit Room
ar: تعديل الغرفة

source: No rooms configured
ar: مفيش غرف متضافة

# addRoomToGetStarted
source: Add a room to get started
ar: ضيف غرفة عشان تبدأ

source: End Session?
ar: إنهاء الجلسة؟

# endSessionConfirmation
source: Are you sure you want to end this session? The customer will be charged for the time used.
ar: متأكد إنك عايز تنهي الجلسة دي؟ هيتحاسب العميل على الوقت اللي استخدمه.

# endSessionButton
source: End Session
ar: إنهاء الجلسة

# statusActive
source: Active
ar: نشط

# statusReserved
source: Reserved
ar: محجوزة

# statusAvailable
source: Available
ar: متاحة

# statusOccupied
source: Occupied
ar: مشغولة

# statusMaintenance
source: Maintenance
ar: صيانة

source: Reserved ({countdown})
ar: محجوزة ({countdown})

source: Expiring...
ar: على وشك الانتهاء...

# perHour
source: /hr
ar: /ساعة

source: Name
ar: الاسم

# nameRequired
source: Name *
ar: الاسم *

source: Description
ar: الوصف

source: Optional description
ar: وصف اختياري

source: Hourly Rate ($) *
ar: سعر الساعة (جنيه) *

source: Menu
ar: المنيو

source: Categories
ar: الأقسام

source: Add item
ar: إضافة صنف

source: Add category
ar: إضافة قسم

source: Edit Category
ar: تعديل القسم

source: All
ar: الكل

source: No items found
ar: مفيش أصناف

source: Delete Item?
ar: حذف الصنف؟

# deleteItemConfirmation
source: Are you sure you want to delete "{name}"?
ar: متأكد إنك عايز تحذف "{name}"؟

# availableLabel
source: Available
ar: متاح

source: Unavailable
ar: مش متاح

source: No categories found
ar: مفيش أقسام

# clickAddCategoryHint
source: Click the + button above to create one
ar: اضغط على + فوق عشان تضيف واحد

source: Category Name
ar: اسم القسم

# categoryNameHint
source: e.g., Drinks, Food, Desserts
ar: مثلاً: مشروبات، أكل، حلويات

# categoryCreatedSuccess
source: Category created successfully
ar: تم إنشاء القسم بنجاح

# categoryUpdatedSuccess
source: Category updated successfully
ar: تم تحديث القسم بنجاح

# categoryDeletedSuccess
source: Category deleted successfully
ar: تم حذف القسم بنجاح

source: Cannot Delete Category
ar: مينفعش تحذف القسم ده

# categoryHasItems
source: This category has {count} {count, plural, =1{item} other{items}}. Move or delete the items before deleting the category.
ar: القسم ده فيه {count} {count, plural, =1{صنف} other{أصناف}}. امسح أو انقل الأصناف الأول.

source: Delete Category?
ar: حذف القسم؟

# deleteCategoryConfirmation
source: Are you sure you want to delete "{name}"?
ar: متأكد إنك عايز تحذف "{name}"؟

source: Back to menu
ar: رجوع للمنيو

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

source: Admin User
ar: مستخدم أدمن

source: About
ar: عن التطبيق

source: App Version
ar: إصدار التطبيق

source: Identity Provider
ar: مزود الهوية

source: Orders API
ar: API الطلبات

source: Rooms API
ar: API الغرف

source: Catalog API
ar: API الكتالوج

# signOutQuestion
source: Sign Out?
ar: تسجيل الخروج؟

# signOutConfirmation
source: Are you sure you want to sign out?
ar: متأكد إنك عايز تسجل خروج؟

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: Accounts
ar: الحسابات

source: Add Charge
ar: إضافة رصيد

source: Total Outstanding
ar: إجمالي المستحق

source: Search by name...
ar: ابحث بالاسم...

source: No accounts found
ar: مفيش حسابات

# addChargeToCreate
source: Add a charge to create an account
ar: ضيف رصيد عشان تعمل حساب

source: Today
ar: النهاردة

source: Yesterday
ar: إمبارح

# daysAgo
source: {days}d ago
ar: من {days} يوم

source: Customer
ar: العميل

# customerRequired
source: Customer *
ar: العميل *

source: Search customer by name...
ar: ابحث عن العميل بالاسم...

source: Amount
ar: المبلغ

source: Amount (EGP) *
ar: المبلغ (جنيه) *

# descriptionOptional
source: Description
ar: الوصف

# chargeDescriptionHint
source: e.g., Remaining from session - Room 3
ar: مثلاً: باقي من جلسة - غرفة 3

# pleaseEnterValidAmount
source: Please enter a valid amount
ar: من فضلك اكتب مبلغ صحيح

# chargeAddedSuccess
source: Charge added successfully
ar: تم إضافة الرصيد بنجاح

source: Failed to add charge
ar: فشل إضافة الرصيد

source: Loyalty
ar: الولاء

source: Overview
ar: نظرة عامة

# accountsLabel
source: Accounts
ar: حسابات

# todayLabel
source: Today
ar: النهاردة

# weekLabel
source: Week
ar: الأسبوع

# monthLabel
source: Month
ar: الشهر

source: Tiers
ar: المستويات

# noLoyaltyAccounts
source: No loyalty accounts yet
ar: مفيش حسابات ولاء لسه

# points
source: pts
ar: نقطة

source: lifetime
ar: إجمالي

source: Requests
ar: الخدمات

source: All clear
ar: تمام

source: No pending requests
ar: مفيش خدمات معلقة

source: Acknowledge
ar: استلام

source: Mark Complete
ar: تم

# pendingStatus
source: Pending
ar: معلّق

source: In Progress
ar: جاري التنفيذ

source: Done
ar: خلص

source: Room
ar: الاوضة

source: Time
ar: الوقت

source: TAP
ar: اضغط

# doneLabel
source: DONE
ar: تم

source: Just now
ar: دلوقتي

# minutesAgo
source: {minutes}m ago
ar: من {minutes} دقيقة

# hoursAgo
source: {hours}h ago
ar: من {hours} ساعة

source: Call Waiter
ar: استدعاء ويتر

source: Controller Change
ar: تغيير الدراع

source: Receipt to Pay
ar: الفاتورة للدفع

source: Customers
ar: العملاء

source: More
ar: المزيد

source: now
ar: دلوقتي

source: End
ar: إنهاء

source: No
ar: لا

source: Cancel Reservation
ar: إلغاء الحجز

# cancelReservationQuestion
source: Cancel Reservation?
ar: إلغاء الحجز؟

# cancelReservationConfirmation
source: Are you sure you want to cancel this reservation?
ar: متأكد إنك عايز تلغي الحجز ده؟

source: Delete Room?
ar: حذف الغرفة؟

# deleteRoomConfirmation
source: Delete "{name}"? This cannot be undone.
ar: حذف "{name}"؟ مينفعش ترجع فيه.

source: Start Session
ar: ابدأ جلسة

source: Reserve
ar: حجز

source: Walk-in
ar: زيارة مباشرة

# customerWillBeCharged
source: The customer will be charged for the time used.
ar: هيتحاسب العميل على الوقت اللي استخدمه.

source: Access code copied!
ar: تم نسخ كود الدخول!

source: Record
ar: تسجيل

source: Payment recorded
ar: تم تسجيل الدفع

source: Failed to record payment
ar: فشل تسجيل الدفع

source: Charge
ar: رصيد

source: Payment
ar: دفع

source: Adjust
ar: تعديل

source: Add Points
ar: إضافة نقاط

# pleaseEnterValidPoints
source: Please enter a valid points amount
ar: من فضلك اكتب عدد نقاط صحيح

source: Points adjusted
ar: تم تعديل النقاط

source: Points added
ar: تم إضافة النقاط

source: Failed to adjust points
ar: فشل تعديل النقاط

source: Failed to add points
ar: فشل إضافة النقاط

# pleaseSelectCategory
source: Please select a category
ar: من فضلك اختار قسم

# accountTab
source: Account
ar: الحساب

# loyaltyTab
source: Loyalty
ar: الولاء

source: Logout
ar: تسجيل الخروج

# logoutConfirmation
source: Are you sure you want to logout?
ar: متأكد إنك عايز تسجل خروج؟

# viewAllOrdersCount
source: View all {count} orders
ar: عرض كل الـ {count} طلب

# amountEgpLabel
source: Amount (EGP)
ar: المبلغ (جنيه)

source: Ready to Start
ar: جاهز للبدء

# codeLabel
source: Code: {code}
ar: الكود: {code}

source: Balance
ar: الرصيد

source: Member since
ar: عضو من

source: Status
ar: الحالة

source: Disabled
ar: معطّل

source: Customer not found
ar: العميل مش موجود

source: Account not found
ar: الحساب مش موجود

source: Order History
ar: سجل الطلبات

source: No orders yet
ar: مفيش طلبات لسه

source: View Customer
ar: عرض العميل

source: History
ar: السجل

source: No transactions yet
ar: مفيش معاملات لسه

source: Current Balance
ar: الرصيد الحالي

# cashPaymentHint
source: e.g., Cash payment
ar: مثلاً: دفع كاش

# sessionBalanceHint
source: e.g., Session balance
ar: مثلاً: رصيد الجلسة

source: Charge added
ar: تم إضافة الرصيد

source: Loyalty Account
ar: حساب الولاء

source: Points Balance
ar: رصيد النقاط

# usePositiveToAdd
source: Use positive to add, negative to deduct
ar: استخدم رقم موجب للإضافة، سالب للخصم

source: Reason
ar: السبب

# correctionHint
source: e.g., Correction
ar: مثلاً: تصحيح

# bonusPointsHint
source: e.g., Bonus points
ar: مثلاً: نقاط مكافأة

# pointsValueHint
source: e.g., 100 or -50
ar: مثلاً: 100 أو -50

source: Edit Menu Item
ar: تعديل صنف

source: Add Menu Item
ar: إضافة صنف

source: Enter item name
ar: اكتب اسم الصنف

source: Enter item description
ar: اكتب وصف الصنف

source: Price
ar: السعر

# categoryRequired
source: Category *
ar: القسم *

source: Select category
ar: اختار قسم

# preparationTime
source: Preparation Time (minutes)
ar: وقت التحضير (دقائق)

# prepTimeHint
source: e.g. 10
ar: مثلاً 10

source: Search by name or email...
ar: ابحث بالاسم أو الإيميل...

source: No customers found
ar: مفيش عملاء

# roomNameHint
source: e.g. PlayStation Room 1
ar: مثلاً: غرفة بلايستيشن 1

# tierBronze
source: BRONZE
ar: برونزي

# tierSilver
source: SILVER
ar: فضي

# tierGold
source: GOLD
ar: ذهبي

# tierPlatinum
source: PLATINUM
ar: بلاتيني

source: No sessions yet
ar: مفيش جلسات لسه

source: Load more
ar: تحميل المزيد

source: Sessions
ar: الجلسات

source: Expired - Auto-cancelling...
ar: انتهى - بيتلغي...

# autoCancelIn
source: Auto-cancel in {countdown}
ar: هيتلغي في {countdown}

# expiresIn
source: Expires in {countdown}
ar: بينتهي في {countdown}

# currency
source: EGP
ar: ج.م

# priceFormat
source: £{price}
ar: {price} ج.م

# hourlyRateFormat
source: £{rate}/hr
ar: {rate} ج.م/ساعة

source: Change Password
ar: تغيير الباسورد

# usersManagement
source: Users
ar: المستخدمين

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم

source: New Password
ar: الباسورد الجديد

source: Confirm Password
ar: تأكيد الباسورد

# passwordsDoNotMatch
source: Passwords don't match
ar: الباسوردين مش متطابقين

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير الباسورد بنجاح

# passwordMinLength
source: Password must be at least 8 characters
ar: الباسورد لازم يكون 8 حروف على الأقل

source: Add Admin
ar: إضافة أدمن

source: No users found
ar: مفيش مستخدمين

# adminRole
source: Admin
ar: أدمن

# customerRole
source: Customer
ar: عميل

# adminCreatedSuccess
source: Admin created successfully
ar: تم إنشاء الأدمن بنجاح

source: Enabled
ar: مفعّل

source: Enter new password
ar: اكتب الباسورد الجديد

source: Email
ar: الإيميل

# enterEmail
source: Enter email address
ar: اكتب الإيميل

source: Enter name
ar: اكتب الاسم

# version
source: Version {version}
ar: الإصدار {version}

source: Need help? Contact us:
ar: محتاج مساعدة؟ تواصل معانا:

# supportHours
source: Available 24/7
ar: متاحين 24/7

# cafeAndGaming
source: CAFE & GAMING
ar: كافيه وجيمنج

# aboutDescription
source: Your destination for relaxation, gaming, and great food.
ar: وجهتك للاسترخاء والجيمنج والأكل الحلو.

source: Appearance
ar: المظهر

source: Theme
ar: الثيم

source: Light
ar: فاتح

source: Dark
ar: غامق

source: System Default
ar: زي الجهاز

source: Select Theme
ar: اختار الثيم

# lightThemeDescription
source: Always use light theme
ar: الثيم الفاتح دايماً

# darkThemeDescription
source: Always use dark theme
ar: الثيم الغامق دايماً

# systemDefaultDescription
source: Follow your device settings
ar: زي إعدادات الجهاز

source: Select Language
ar: اختار اللغة

# transactionTypePurchase
source: Purchase
ar: شراء

# transactionTypeBonus
source: Bonus
ar: مكافأة

# transactionTypeReferral
source: Referral
ar: إحالة

# transactionTypePromotion
source: Promotion
ar: عرض

# transactionTypeRedemption
source: Redemption
ar: استبدال

# transactionTypeAdjustment
source: Adjustment
ar: تعديل

# pointsEarnedFromOrder
source: Points earned from Order #{orderId}
ar: نقط مكتسبة من طلب #{orderId}

# pointsRedeemedForOrder
source: Points redeemed for Order #{orderId}
ar: نقط مستخدمة في طلب #{orderId}

# addMenuItemPage
source: Add Menu Item
ar: إضافة صنف

# editMenuItemPage
source: Edit Menu Item
ar: تعديل صنف

source: Customizations
ar: التخصيصات

source: Add Customization
ar: إضافة تخصيص

source: Edit Customization
ar: تعديل تخصيص

source: Customization Name
ar: اسم التخصيص

# customizationNameHint
source: e.g., Size, Extras, Sugar Level
ar: مثلاً: الحجم، الإضافات، مستوى السكر

source: Required
ar: مطلوب

source: Allow Multiple
ar: سماح باختيار متعدد

source: Options
ar: الخيارات

source: Add Option
ar: إضافة خيار

source: Option Name
ar: اسم الخيار

# optionNameHint
source: e.g., Small, Medium, Large
ar: مثلاً: صغير، وسط، كبير

source: Price Adjustment
ar: تعديل السعر

# priceAdjustmentHint
source: e.g., 10 or -5
ar: مثلاً: 10 أو -5

# defaultOption
source: Default
ar: افتراضي

source: Take Photo
ar: التقاط صورة

source: Choose from Gallery
ar: اختيار من المعرض

source: Change Image
ar: تغيير الصورة

source: Remove Image
ar: إزالة الصورة

source: Item Image
ar: صورة الصنف

source: Tap to add image
ar: اضغط لإضافة صورة

source: No customizations
ar: مفيش تخصيصات

# addCustomizationsHint
source: Add customizations like size or extras
ar: ضيف تخصيصات زي الحجم أو الإضافات

# optionRequired
source: At least one option is required
ar: لازم خيار واحد على الأقل

# savingItem
source: Saving...
ar: جاري الحفظ...

# itemSaved
source: Item saved successfully
ar: تم حفظ الصنف

source: Failed to save item
ar: فشل حفظ الصنف

# deleteCustomizationConfirm
source: Delete this customization?
ar: مسح التخصيص ده؟

# deleteOptionConfirm
source: Delete this option?
ar: مسح الخيار ده؟

# optionsCount
source: {count} {count, plural, =1{option} other{options}}
ar: {count} {count, plural, =1{خيار} other{خيارات}}

source: Reorder
ar: ترتيب

source: Save Order
ar: حفظ الترتيب

# orderSavedSuccess
source: Order saved successfully
ar: تم حفظ الترتيب بنجاح

source: Failed to save order
ar: فشل حفظ الترتيب

source: All Orders
ar: كل الطلبات

source: Loyalty Discount
ar: خصم النقاط

source: Subtotal
ar: المجموع الفرعي

source: Update Name
ar: تعديل الاسم

source: New Name
ar: الاسم الجديد

# enterNewName
source: Enter your new name
ar: اكتب اسمك الجديد

source: Name updated successfully
ar: تم تعديل الاسم بنجاح

source: Failed to update name
ar: فشل تعديل الاسم

source: No orders found
ar: مفيش طلبات

# createStrongPassword
source: Create a strong password
ar: اختار باسورد قوي

# passwordRequirements
source: Must be at least 8 characters
ar: لازم يكون 8 حروف على الأقل

source: Password changed successfully
ar: تم تغيير الباسورد بنجاح

source: Failed to change password
ar: فشل تغيير الباسورد

source: Your display name
ar: اسمك
